CSI API ETABS v1

# cDesignCompositeColumnGetComboDeflection Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetComboDeflection(
    	ref int NumberItems,
    	ref string[] MyName
    )

    Function GetComboDeflection (
    	ByRef NumberItems As Integer,
    	ByRef MyName As String()
    ) As Integer

    Dim instance As cDesignCompositeColumn
    Dim NumberItems As Integer
    Dim MyName As String()
    Dim returnValue As Integer

    returnValue = instance.GetComboDeflection(NumberItems,
    	MyName)

    int GetComboDeflection(
    	int% NumberItems,
    	array<String^>^% MyName
    )

    abstract GetComboDeflection :
            NumberItems : int byref *
            MyName : string[] byref -> int

#### Parameters

NumberItems

    Type: SystemInt32

MyName

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cDesignCompositeColumn Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com